saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC4300_DFP.2.8.0.pdsc
      <compile   Pname="Cortex-M4" define="CORE_M4"/>
      <compile   Pname="Cortex-M0" define="CORE_M0"/>

      <compile header="Device/Include/LPC43xx.h"/>

      <book Pname="Cortex-M4" name="Documents/dui0553a_cortex_m4_dgug.pdf"            title="Cortex-M4 Generic User Guide"/>
      <book Pname="Cortex-M0" name="Documents/dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
      <book                   name="Documents/UM10503.pdf"                            title="LPC43xx/LPC43Sxx User Manual"/>
      <book                   name="Documents/ES_LPC43X0.pdf"                         title="LPC4370/50/30/20/10 Errata Sheet"/>
      <book                   name="Documents/TN00006.pdf"                            title="LPC1800/LPC4300 Memory Map"/>

      <description>
NXP's LPC4300 Digital Signal Control (DSC) processors, offers high-performance signal processing capabilities. These DSC processors offer a high level of system integration, reducing system design cost and complexity, while simplifying the design cycle using a single tool chain.
Typical applications include Motor control, Embedded audio applications, Power management, Industrial automation, White goods, e-metering, RFID readers

  - Three PLLs
  - Quad SPI Flash interface (SPIFI)
  - State Configurable Timer (SCT)
  - LCD Controller (1024x768) for STN and TFT
  - Motor control PWM for three-phase motor
  - Unique ID for each device
      </description>

      <feature type="CAN"           n="2"/>
      <feature type="UART"          n="4"/>
      <feature type="I2C"           n="2"/>
      <feature type="Timer"         n="4"       m="32"/>

      <!-- ************************  Debug Description  **************************** -->
      <debug Pname="Cortex-M4" __dp="0" __ap="0" svd="SVD/LPC43xx.svd">
        <!-- Make ETB always visible in ROM Table (otherwise only visible after clearing ETBCFG register) -->
        <datapatch address="0xE00FF018" value="0xFFF43003" info="ROM Table Entry: ETB"/>
      </debug>
      <debug Pname="Cortex-M0" __dp="1" __ap="0" svd="SVD/LPC43xx.svd"/>
      <debug defaultResetSequence="ResetProcessor" Pname="Cortex-M4"/>
      <debug defaultResetSequence="ResetProcessor" Pname="Cortex-M0"/>

      <debugport __dp="0">          <!-- Cortex-M4 DP-->
        <jtag tapindex="0"/>
        <swd/>
      </debugport>
      <debugport __dp="1">          <!-- Cortex-M0 DP-->
        <jtag tapindex="1"/>
        <!-- no SWD support for Cortex-M0 -->
      </debugport>

      <debugvars configfile="Debug/LPC43xx.dbgconf">
        __var VecResetWithPeriph    = 1; // Reset peripherals on Vector Reset (similar to System Reset without M0 reset)
        __var ReleaseM0OnConnect    = 1; // Release M0 from reset during connection to it
        __var ReleaseM0SubOnConnect = 1; // Release M0-Subsystem from reset during connection to it (LPC437x only)

        // TPIU Pin Routing (TRACECLK fixed on PF_4)
        // - Bit 0: TRACEDATA[0]: 0 - PF_5, 1 - P7_4
        // - Bit 1: TRACEDATA[1]: 0 - PF_6, 1 - P7_5
        // - Bit 2: TRACEDATA[2]: 0 - PF_7, 1 - P7_6
        // - Bit 3: TRACEDATA[3]: 0 - PF_8, 1 - P7_7
        __var RoutingTPIU = 0x00000000;  // Default selection (MCB4300)
      </debugvars>


      <sequences>

        <!-- Pre-defined Debug Access Sequences -->

        <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
        <!-- Be aware that this sequence only works when the target is stopped before the reset -->
        <sequence name="ResetProcessor" Pname="Cortex-M4">
          <block>
            // Execute VECTRESET via AIRCR
            Write32(0xE000ED0C, 0x05FA0001);

            // Reset Cortex-M0 APP and SUB Core and all peripherals except BUS_RST, SCU_RST, EMC_RST, SPIFI
            Write32(0x40053100, 0xFFDF1030);    // regiserAccess: RESET_CTRL0(0x40053100)
            Write32(0x40053104, 0xFBDFFFFF);    // registerAccess: RESET_CTRL1(0x40053104)
          </block>
        </sequence>

        <!-- Begin: ResetProcessor Sequence for Cortex-M0-->
        <sequence name="ResetProcessor" Pname="Cortex-M0">
          <block>
            // Reset only Cortex-M0 APP Core
            Write32(0x40053104, 0x01000000);

            // Clear Exception States (safe, Core in reset)
            Write32(0xE000ED0C, 0x05FA0002);

            // Release from reset
            Write32(0x40053104, 0);
          </block>
        </sequence>


        <!-- Begin: DebugCoreStart Sequence for Cortex-M4 -->
        <sequence name="DebugCoreStart" Pname="Cortex-M4">
          <block>
            // Default implementation

            // Enable Core Debug via DHCSR
            Write32(0xE000EDF0, 0xA05F0001);
          </block>
        </sequence>
        <!-- End: DebugCoreStart Sequence for Cortex-M4 -->

        <!-- Begin: DebugCoreStart Sequence for Cortex-M0 -->
        <sequence name="DebugCoreStart" Pname="Cortex-M0">
          <block>
            // Default implementation

            // Enable Core Debug via DHCSR
            Write32(0xE000EDF0, 0xA05F0001);
          </block>

          <control if="ReleaseM0OnConnect">
            <block>
              // Release M0 from reset
              Write32(0x40053104, 0x00000000);  // RESET_CTRL1: Clear M0APP_RST (Bit 24)
            </block>
          </control>
        </sequence>
        <!-- End: DebugCoreStart Sequence for Cortex-M0 -->


        <!-- Begin: ResetCatchSet Sequence for Cortex-M4 -->
        <sequence name="ResetCatchSet" Pname="Cortex-M4">
          <block>
            __var resetVecBankA = 0;
            __var resetVecBankB = 0;

            // Clear Reset Vector Catch
            Write32(0xE000EDFC, Read32(0xE000EDFC) &amp; (~0x00000001));

            // Read reset vector from bank A
            resetVecBankA = Read32(0x1A000004);
            // Read reset vector from bank B
            resetVecBankB = Read32(0x1B000004);
          </block>

          <control if="resetVecBankA &lt; 0x20000000">
            <!-- Reset Vector of bank A in HW Breakpoint range-->
            <control if="(resetVecBankA &amp; 0x2) == 0">
              <block>
                // Even Address
                Write32(0xE0002008, (resetVecBankA &amp; 0x1FFFFFFC) | 0x40000001); // Write address to FPB Comparator 0
              </block>
            </control>
            <control if="resetVecBankA &amp; 0x2">
              <block>
                // Odd Address
                Write32(0xE0002008, (resetVecBankA &amp; 0x1FFFFFFC) | 0x80000001); // Write address to FPB Comparator 0
              </block>
            </control>
            <block>
              // Enable FPB
              Write32(0xE0002000, 0x00000003);
            </block>
          </control>

          <control if="resetVecBankA &gt;= 0x20000000" info="Enable reset vector catch">
            <block>
              // Enable Reset Vector Catch in DEMCR
              Write32(0xE000EDFC, (Read32(0xE000EDFC) | 0x00000001));
            </block>
          </control>

          <control if="resetVecBankB &lt; 0x20000000">
            <!-- Reset Vector of bank B in HW Breakpoint range-->
            <control if="(resetVecBankB &amp; 0x2) == 0">
              <block>
                // Even Address
                Write32(0xE000200C, (resetVecBankB &amp; 0x1FFFFFFC) | 0x40000001); // Write address to FPB Comparator 1
              </block>
            </control>
            <control if="resetVecBankA &amp; 0x2">
              <block>
                // Odd Address
                Write32(0xE000200C, (resetVecBankB &amp; 0x1FFFFFFC) | 0x80000001); // Write address to FPB Comparator 1
              </block>
            </control>
            <block>
              // Enable FPB
              Write32(0xE0002000, 0x00000003);
            </block>
          </control>

