saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC4300_DFP.2.8.0.pdsc
        <!-- Begin: User-defined EnableTraceBuffer Sequence -->
        <sequence name="EnableTraceBuffer">
          <block>
            // ETB accesses SRAM at 0x2000C000 - 0x2000FFFF.
            //  This memory region is not available to application when using ETB.
            Write32(0x40043128, 0x00000000); // ETBCFG: ETB bit
          </block>
        </sequence>
        <!-- End: User-defined EnableTraceBuffer Sequence -->

        <!-- Begin: User-defined DisableTraceTPIU Sequence -->
        <sequence name="DisableTraceTPIU">
          <block>
            __var tracePortWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;

            // Setup fixed TRACECLK pin
            Write32(0x40086790, 0x00000000); // LPC_SCU->SFSPF_4 : Reset Value 0x00000000
          </block>

          <!-- TRACEDATA[0]-->
          <control if="(RoutingTPIU &amp; 0x1) == 0">
            <!-- TRACEDATA[0]: PF_5 -->
            <block>
              Write32(0x40086794, 0x00000000); // LPC_SCU->SFSPF_5 : Reset Value 0x00000000
            </block>
          </control>
          <control if="(RoutingTPIU &amp; 0x1)">
            <!-- TRACEDATA[0]: P7_4 -->
            <block>
              Write32(0x40086390, 0x00000000); // LPC_SCU->SFSP7_4 : Reset Value 0x00000000
            </block>
          </control>


          <control if="tracePortWidth &gt;= 2">
            <!-- TRACEDATA[1]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[1]: PF_6 -->
              <block>
                Write32(0x40086798, 0x00000000); // LPC_SCU->SFSPF_6 : Reset Value 0x00000000
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[1]: P7_5 -->
              <block>
                Write32(0x40086394, 0x00000000); // LPC_SCU->SFSP7_5 : Reset Value 0x00000000
              </block>
            </control>
          </control>

          <control if="tracePortWidth &gt;= 4">
            <!-- TRACEDATA[2]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[2]: PF_7 -->
              <block>
                Write32(0x4008679C, 0x00000000); // LPC_SCU->SFSPF_7 : Reset Value 0x00000000
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[2]: P7_6 -->
              <block>
                Write32(0x40086398, 0x00000000); // LPC_SCU->SFSP7_6 : Reset Value 0x00000000
              </block>
            </control>

            <!-- TRACEDATA[3]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[3]: PF_8 -->
              <block>
                Write32(0x400867A0, 0x00000000); // LPC_SCU->SFSPF_8 : Reset Value 0x00000000
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[3]: P7_7 -->
              <block>
                Write32(0x4008639C, 0x00000000); // LPC_SCU->SFSP7_7 : Reset Value 0x00000000
              </block>
            </control>
          </control>

        </sequence>
        <!-- End: User-defined DisableTraceTPIU Sequence -->

        <!-- Begin: User-defined DisableTraceBuffer Sequence -->
        <sequence name="DisableTraceBuffer">
          <block>
            // AHB accesses SRAM at 0x2000C000 - 0x2000FFFF.
            Write32(0x40043128, 0x00000001); // ETBCFG: ETB bit
          </block>
        </sequence>
        <!-- End: User-defined DisableTraceBuffer Sequence -->
      </sequences>
      <!-- ***********************  End Debug Description **************************** -->

      <!-- ************************  Subfamily 'LPC4310'  **************************** -->
      <subFamily DsubFamily="LPC431x">
        <processor Pname="Cortex-M4" Dfpu="1"/>

        <feature type="SPI"           n="2"/>
        <feature type="MPSerial"      n="2"                           name="SSP"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Device 'LPC4310'  ***************************** -->
        <device Dname="LPC4310">
          <memory id="IRAM1"                      start="0x10000000"  size="0x18000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>

          <book name="Documents/LPC4350_30_20_10.pdf" title="LPC4350/30/20/10 Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC4312'  ***************************** -->
        <device Dname="LPC4312">
          <memory id="IROM1"                      start="0x1A000000"  size="0x80000"    startup="1"   default="1"/>
          <memory id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

          <book name="Documents/LPC435X_3X_2X_1X.pdf" title="LPC435x/3x/2x/1x Data Sheet"/>
        </device>

        <!-- *************************  Device 'LPC4313'  ***************************** -->
        <device Dname="LPC4313">
          <memory id="IROM1"                      start="0x1A000000"  size="0x40000"    startup="1"   default="1"/>
          <memory id="IROM2"                      start="0x1B000000"  size="0x40000"    startup="0"   default="1"/>
          <memory id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_256_BA.FLM" start="0x1A000000" size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <algorithm name="Flash/LPC18xx43xx_256_BB.FLM" start="0x1B000000" size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>

